{
    "es": {
      "contributions": [
        {
          "name": "Desarrollo de Aplicaciones Web y Portales",
          "tasks": [
            "Implementación y desarrollo de nuevas funcionalidades, mejoras, y mantenimiento en portales de proveedores y aplicaciones internas para diferentes clientes (CENOSA, Do it Center, ILP, CEMPRO, MQA Americas, Feduro).",
            "Automatización de procesos y flujos, integración de servicios web y creación de APIs para intercambio de datos con sistemas externos."
          ]
        },
        {
          "name": "Configuración e Implementación de Servicios",
          "tasks": [
            "Configuración de servidores (IIS, Linux, Windows Server), servicios web y despliegue de aplicaciones en entornos de desarrollo y producción.",
            "Ajuste y optimización de infraestructuras para asegurar el correcto funcionamiento de aplicaciones críticas y servicios web (ILP, CEMPRO, Feduro)."
          ]
        },
        {
          "name": "Soporte y Mantenimiento de Aplicaciones",
          "tasks": [
            "Resolución de incidencias y soporte en producción, incluyendo la implementación de parches, ajustes de configuración y optimización de aplicaciones.",
            "Mantenimiento y mejora continua de sistemas, incluyendo la creación de logs de auditoría y validación de flujos operativos."
          ]
        },
        {
          "name": "Desarrollo de Funcionalidades Específicas",
          "tasks": [
            "Desarrollo de módulos especializados como reportes de análisis, sistemas de gestión de puntos de fidelidad, creación de flujos de firma digital, y mejora en la experiencia de usuario.",
            "Implementación de funcionalidades como filtros avanzados, campos adicionales en formularios, y endpoints para consultas específicas (CENOSA, Do it Center, ILP)."
          ]
        },
        {
          "name": "Colaboración en Proyectos y Coordinación",
          "tasks": [
            "Participación en reuniones de coordinación y pruebas integrales para asegurar la calidad de las implementaciones.",
            "Colaboración estrecha con equipos multidisciplinarios para definir, desarrollar, y desplegar nuevas soluciones tecnológicas."
          ]
        },
        {
          "name": "Documentación y Capacitación",
          "tasks": [
            "Creación y actualización de documentación técnica, incluyendo manuales de usuario y guías de configuración para desarrollos y servicios implementados.",
            "Capacitación a usuarios y equipos de soporte sobre el uso y administración de nuevas herramientas y sistemas."
          ]
        },
        {
          "name": "Estimación y Planificación de Proyectos",
          "tasks": [
            "Participación en la estimación y planificación de proyectos para la construcción de nuevos portales, reconstrucción de servicios web y desarrollo de módulos específicos (MQA Americas, Feduro)."
          ]
        }
      ]
    },
    "en": {
      "contributions": [
        {
          "name": "Web Applications and Portals Development",
          "tasks": [
            "Implementation and development of new features, improvements, and maintenance of supplier portals and internal applications for various clients (CENOSA, Do it Center, ILP, CEMPRO, MQA Americas, Feduro).",
            "Automation of processes and workflows, integration of web services, and creation of APIs for data exchange with external systems."
          ]
        },
        {
          "name": "Service Configuration and Implementation",
          "tasks": [
            "Configuration of servers (IIS, Linux, Windows Server), web services, and deployment of applications in development and production environments.",
            "Adjustment and optimization of infrastructures to ensure the proper functioning of critical applications and web services (ILP, CEMPRO, Feduro)."
          ]
        },
        {
          "name": "Application Support and Maintenance",
          "tasks": [
            "Incident resolution and production support, including patch implementation, configuration adjustments, and application optimization.",
            "Continuous maintenance and improvement of systems, including the creation of audit logs and validation of operational workflows."
          ]
        },
        {
          "name": "Specific Features Development",
          "tasks": [
            "Development of specialized modules such as analysis reports, loyalty points management systems, creation of digital signature flows, and improvement of user experience.",
            "Implementation of functionalities like advanced filters, additional fields in forms, and endpoints for specific queries (CENOSA, Do it Center, ILP)."
          ]
        },
        {
          "name": "Project Collaboration and Coordination",
          "tasks": [
            "Participation in coordination meetings and comprehensive testing to ensure the quality of implementations.",
            "Close collaboration with multidisciplinary teams to define, develop, and deploy new technological solutions."
          ]
        },
        {
          "name": "Documentation and Training",
          "tasks": [
            "Creation and updating of technical documentation, including user manuals and configuration guides for implemented developments and services.",
            "Training users and support teams on the use and administration of new tools and systems."
          ]
        },
        {
          "name": "Project Estimation and Planning",
          "tasks": [
            "Involvement in estimating and planning projects for building new portals, rebuilding web services, and developing specific modules (MQA Americas, Feduro)."
          ]
        }
      ]
    }
  }
  