{
  "en": {
    "education": [
      {
        "degree": "Full Stack Development",
        "institution": "CODERHOUSE",
        "dates": "12/FEB/2022 - 14/MAY/2023",
        "logo": "./src/assets/logos/coderhouse.jpeg"
      },
      {
        "degree": "Backend Developer",
        "institution": "CODERHOUSE",
        "dates": "14/OCT/2022 - 14/MAY/2023",
        "logo": "./src/assets/logos/coderhouse.jpeg"
      },
      {
        "degree": "React Developer",
        "institution": "CODERHOUSE",
        "dates": "14/AUG/2022 - 14/OCT/2022",
        "logo": "./src/assets/logos/coderhouse.jpeg"
      },
      {
        "degree": "JavaScript Developer",
        "institution": "CODERHOUSE",
        "dates": "14/MAY/2022 - 14/AUG/2022",
        "logo": "./src/assets/logos/coderhouse.jpeg"
      },
      {
        "degree": "Web Developer",
        "institution": "CODERHOUSE",
        "dates": "12/FEB/2022 - 14/MAY/2022",
        "logo": "./src/assets/logos/coderhouse.jpeg"
      },
      {
        "degree": "Programmer - Web Development",
        "institution": "Universidad Del Norte (Colombia)",
        "dates": "01/FEB/2021 - 30/NOV/2021",
        "logo": "./src/assets/logos/uninorte.jpeg"
      },
      {
        "degree": "Technician in Accounting of Commercial and Financial Operations",
        "institution": "I.E.D Liceo Samario (SENA)",
        "dates": "10/JAN/2018 - 30/OCT/2019",
        "logo": "./src/assets/logos/sena.png"
      },
      {
        "degree": "High School",
        "institution": "I.E.D Liceo Samario",
        "dates": "10/JAN/2013 - 30/OCT/2019",
        "logo": "./src/assets/logos/lisama.jpg"
      }
    ],
    "employment_history": [
      {
        "position": "Consultant - Full Stack Developer",
        "company": "Néutica",
        "dates": "20/AUG/2024 - Present",
        "logo": "./src/assets/logos/neutica.png",
        "contributions": [
          {
            "name": "Wallet Management App",
            "link": "https://walletmanagement.app",
            "tasks": [
              "Developed using Node.js, NestJS, Spring Boot, and React.",
              "Web application for personal and business financial management, focused on tracking transactions, categories, and supporting attachments.",
              "PDF report generation system with customized financial charts.",
              "Subscription module integrated with LATAM payment gateways (ePayco, Mercado Pago, Zona de Pagos).",
              "Support for scheduled transactions and future integration with custom bank APIs.",
              "Multi-user account management with Business Plan support."
            ]
          },
          {
            "name": "Wallet Management Landing",
            "link": "https://walletmanagement.app/site",
            "tasks": [
              "Landing page built with Astro and Node.js.",
              "Designed to present app features, capture leads, and drive conversions.",
              "SEO-optimized, responsive, and ideal for digital ad campaigns."
            ]
          },
          {
            "name": "Vainilla Rosse",
            "link": "https://vainillarosse.com",
            "tasks": [
              "Official landing page for the launch of the jewelry brand, including countdown timer.",
              "Developed with Astro and NestJS.",
              "Elegant, modern visual design focused on brand value and lead generation.",
              "SEO optimization, fast loading, and modular architecture for future scaling."
            ]
          },
          {
            "name": "Néutica",
            "link": "https://neutica.tech",
            "tasks": [
              "Agency landing page developed with Astro, React, and NestJS.",
              "Responsive and modern design showcasing mission, vision, values, and services by sector.",
              "Dynamic JSON-based services structure for flexibility and scalability.",
              "Interactive UI components with smooth animations and SEO-friendly architecture."
            ]
          },
          {
            "name": "BlackFrost",
            "link": "https://blackfrost.es",
            "tasks": [
              "Construction project management web app built with React (frontend), Spring Boot (core backend), and NestJS (reporting module).",
              "Complete budget management using a hierarchical tree structure: categories, subcategories, and items.",
              "Work part creation with item selection from the budget and automatic cost calculations for labor and materials.",
              "Expense tracking module with invoice uploads, cloud storage integration (Google Drive), and PDF report generation.",
              "Role-based user management with project-level permissions."
            ]
          },
          {
            "name": "Vainilla Rosse Dashboard",
            "link": "https://dashboard.vainillarosse.com",
            "tasks": [
              "Panel administrativo empresarial desarrollado con Spring Boot (backend) y React + TypeScript (frontend).",
              "Sistema completo de gestión de productos (CRUD): creación, edición, eliminación y visualización con soporte de imágenes y descripciones.",
              "Carga de imágenes con vista previa y validación de peso.",
              "Categorización de productos por colección o tipo, optimizando la organización del catálogo.",
              "Login seguro con autenticación basada en tokens y control de sesión.",
              "Dashboard responsive desarrollado completamente con React + TypeScript.",
              "Integración con Amazon Web Services (S3) para el almacenamiento seguro y eficiente de las imágenes de productos.",
              "Base de datos estructurada en SQL Server, optimizada para consultas rápidas y escalabilidad a largo plazo.",
              "Diseño moderno y coherente con la identidad visual de la marca Vainilla Rosse.",
              "Despliegue en servidor privado con SSL bajo el subdominio de la marca y conexión directa con la landing principal."
            ]
          }
        ]
      },
      {
        "position": "Full Stack Developer",
        "company": "MQA AMERICAS",
        "dates": "19/JUL/2022 - 20/AUG/2024",
        "logo": "./src/assets/logos/mqa.jpeg",
        "contributions": [
          {
            "name": "Web Applications and Portals Development",
            "tasks": [
              "Implementation and development of new features, improvements, and maintenance of supplier portals and internal applications for various clients (CENOSA, Do it Center, ILP, CEMPRO, MQA Americas, Feduro).",
              "Automation of processes and workflows, integration of web services, and creation of APIs for data exchange with external systems."
            ]
          },
          {
            "name": "Service Configuration and Implementation",
            "tasks": [
              "Configuration of servers (IIS, Linux, Windows Server), web services, and deployment of applications in development and production environments.",
              "Adjustment and optimization of infrastructures to ensure the proper functioning of critical applications and web services (ILP, CEMPRO, Feduro)."
            ]
          },
          {
            "name": "Application Support and Maintenance",
            "tasks": [
              "Incident resolution and production support, including patch implementation, configuration adjustments, and application optimization.",
              "Continuous maintenance and improvement of systems, including the creation of audit logs and validation of operational workflows."
            ]
          },
          {
            "name": "Specific Features Development",
            "tasks": [
              "Development of specialized modules such as analysis reports, loyalty points management systems, creation of digital signature flows, and improvement of user experience.",
              "Implementation of functionalities like advanced filters, additional fields in forms, and endpoints for specific queries (CENOSA, Do it Center, ILP)."
            ]
          },
          {
            "name": "Project Collaboration and Coordination",
            "tasks": [
              "Participation in coordination meetings and comprehensive testing to ensure the quality of implementations.",
              "Close collaboration with multidisciplinary teams to define, develop, and deploy new technological solutions."
            ]
          },
          {
            "name": "Documentation and Training",
            "tasks": [
              "Creation and updating of technical documentation, including user manuals and configuration guides for implemented developments and services.",
              "Training users and support teams on the use and administration of new tools and systems."
            ]
          },
          {
            "name": "Project Estimation and Planning",
            "tasks": [
              "Involvement in estimating and planning projects for building new portals, rebuilding web services, and developing specific modules (MQA Americas, Feduro)."
            ]
          }
        ]
      },
      {
        "position": "Intern as Accounting Technician for Commercial and Financial Operations",
        "company": "(ASI) ASESORÍAS Y SISTEMAS INTEGRALES",
        "dates": "21/SEP/2018 - 21/OCT/2019"
      }
    ]
  },
  "es": {
    "education": [
      {
        "degree": "Desarrollo Full Stack",
        "institution": "CODERHOUSE",
        "dates": "12/FEB/2022 - 14/MAY/2023",
        "logo": "./src/assets/logos/coderhouse.jpeg"
      },
      {
        "degree": "Desarrollador Backend",
        "institution": "CODERHOUSE",
        "dates": "14/OCT/2022 - 14/MAY/2023",
        "logo": "./src/assets/logos/coderhouse.jpeg"
      },
      {
        "degree": "Desarrollador React",
        "institution": "CODERHOUSE",
        "dates": "14/AUG/2022 - 14/OCT/2022",
        "logo": "./src/assets/logos/coderhouse.jpeg"
      },
      {
        "degree": "Desarrollador JavaScript",
        "institution": "CODERHOUSE",
        "dates": "14/MAY/2022 - 14/AUG/2022",
        "logo": "./src/assets/logos/coderhouse.jpeg"
      },
      {
        "degree": "Desarrollador Web",
        "institution": "CODERHOUSE",
        "dates": "12/FEB/2022 - 14/MAY/2022",
        "logo": "./src/assets/logos/coderhouse.jpeg"
      },
      {
        "degree": "Programador - Desarrollo Web",
        "institution": "Universidad Del Norte (Colombia)",
        "dates": "01/FEB/2021 - 30/NOV/2021",
        "logo": "./src/assets/logos/uninorte.jpeg"
      },
      {
        "degree": "Técnico en Contabilidad de Operaciones Comerciales y Financieras",
        "institution": "I.E.D Liceo Samario (SENA)",
        "dates": "10/JAN/2018 - 30/OCT/2019",
        "logo": "./src/assets/logos/sena.png"
      },
      {
        "degree": "Bachillerato",
        "institution": "I.E.D Liceo Samario",
        "dates": "10/JAN/2013 - 30/OCT/2019",
        "logo": "./src/assets/logos/lisama.jpg"
      }
    ],
    "employment_history": [
      {
        "position": "Consultor - Full Stack Developer",
        "company": "Néutica",
        "dates": "20/AUG/2024 - Actualmente",
        "logo": "./src/assets/logos/neutica.png",
        "contributions": [
          {
            "name": "Wallet Management App",
            "link": "https://walletmanagement.app",
            "tasks": [
              "Desarrollada con Node.js, NestJS, Spring Boot y React.",
              "Aplicación web de gestión financiera personal y empresarial con enfoque en control de movimientos, categorías y adjuntos de soporte.",
              "Implementación de sistema de reportes en PDF con gráficos financieros personalizados.",
              "Módulo de suscripciones con integración de pasarelas de pago para LATAM (ePayco, Mercado Pago, Zona de Pagos).",
              "Gestión de movimientos programados y sincronización futura con APIs bancarias propias.",
              "Control de usuarios por cuenta y multitenancy en el plan Business."
            ]
          },
          {
            "name": "Wallet Management Landing",
            "link": "https://walletmanagement.app/site",
            "tasks": [
              "Landing page desarrollada con Astro y Node.js.",
              "Diseñada para explicar los beneficios de la app, captar registros y mejorar la conversión.",
              "Optimizada para SEO, responsive y pensada para campañas publicitarias digitales."
            ]
          },
          {
            "name": "Vainilla Rosse",
            "link": "https://vainillarosse.com",
            "tasks": [
              "Landing oficial del lanzamiento de la marca de joyería con conteo regresivo.",
              "Desarrollada con Astro y NestJS.",
              "Diseño visual elegante y moderno enfocado en transmitir valor de marca y captar leads.",
              "Optimización SEO, tiempos de carga mínimos y estructura modular para escalabilidad futura."
            ]
          },
          {
            "name": "Néutica",
            "link": "https://neutica.tech",
            "tasks": [
              "Landing institucional de la agencia desarrollada con Astro, React y NestJS.",
              "Diseño adaptable y moderno que comunica misión, visión, valores y servicios por sector.",
              "Estructura de servicios dinámica basada en JSON, reutilizable y escalable.",
              "Integración de componentes interactivos con animaciones suaves y arquitectura optimizada para SEO."
            ]
          },
          {
            "name": "BlackFrost",
            "link": "https://blackfrost.es",
            "tasks": [
              "Aplicación web de gestión de obras desarrollada con React (frontend), Spring Boot (backend principal) y NestJS (reportes).",
              "Manejo completo de presupuestos con sistema jerárquico tipo árbol: categorías, subcategorías e ítems.",
              "Creación de partes de obra con selección de ítems del presupuesto y cálculo automático de costos por mano de obra y materiales.",
              "Módulo de gastos con control de facturas adjuntas, almacenamiento en la nube (Google Drive) y generación de reportes en PDF.",
              "Sistema de roles y usuarios con permisos diferenciados por proyecto."
            ]
          },
          {
            "name": "Vainilla Rosse Dashboard",
            "link": "https://dashboard.vainillarosse.com",
            "tasks": [
              "Enterprise management dashboard developed with Spring Boot (backend) and React + TypeScript (frontend).",
              "Full CRUD system for product management: creation, editing, deletion, and visualization with image and description support.",
              "Image upload with real-time preview and file size validation.",
              "Product categorization by collection or type for better organization and scalability.",
              "Secure login with token-based authentication and session management.",
              "Responsive dashboard interface built entirely with React + TypeScript.",
              "Integration with Amazon Web Services (S3) for secure and efficient product image storage.",
              "Database structured in SQL Server, optimized for fast queries and long-term scalability.",
              "Modern, brand-aligned design consistent with the Vainilla Rosse visual identity.",
              "Deployed on a private server with SSL under the brand’s subdomain and directly connected to the main landing page."
            ]
          }
        ]
      },
      {
        "position": "Desarrollador Full Stack",
        "company": "MQA AMERICAS",
        "dates": "19/JUL/2022 - 20/AUG/2024",
        "logo": "./src/assets/logos/mqa.jpeg",
        "contributions": [
          {
            "name": "Desarrollo de Aplicaciones Web y Portales",
            "tasks": [
              "Implementación y desarrollo de nuevas características, mejoras y mantenimiento de portales de proveedores y aplicaciones internas para diversos clientes (CENOSA, Do it Center, ILP, CEMPRO, MQA Americas, Feduro).",
              "Automatización de procesos y flujos de trabajo, integración de servicios web y creación de APIs para el intercambio de datos con sistemas externos."
            ]
          },
          {
            "name": "Configuración e Implementación de Servicios",
            "tasks": [
              "Configuración de servidores (IIS, Linux, Windows Server), servicios web y despliegue de aplicaciones en entornos de desarrollo y producción.",
              "Ajuste y optimización de infraestructuras para asegurar el correcto funcionamiento de aplicaciones y servicios web críticos (ILP, CEMPRO, Feduro)."
            ]
          },
          {
            "name": "Soporte y Mantenimiento de Aplicaciones",
            "tasks": [
              "Resolución de incidentes y soporte en producción, incluyendo la implementación de parches, ajustes de configuración y optimización de aplicaciones.",
              "Mantenimiento continuo y mejora de sistemas, incluyendo la creación de registros de auditoría y validación de flujos operativos."
            ]
          },
          {
            "name": "Desarrollo de Funcionalidades Específicas",
            "tasks": [
              "Desarrollo de módulos especializados como informes de análisis, sistemas de gestión de puntos de fidelidad, creación de flujos de firmas digitales y mejora de la experiencia del usuario.",
              "Implementación de funcionalidades como filtros avanzados, campos adicionales en formularios y puntos de acceso para consultas específicas (CENOSA, Do it Center, ILP)."
            ]
          },
          {
            "name": "Colaboración y Coordinación de Proyectos",
            "tasks": [
              "Participación en reuniones de coordinación y pruebas exhaustivas para asegurar la calidad de las implementaciones.",
              "Colaboración cercana con equipos multidisciplinarios para definir, desarrollar y desplegar nuevas soluciones tecnológicas."
            ]
          },
          {
            "name": "Documentación y Capacitación",
            "tasks": [
              "Creación y actualización de documentación técnica, incluyendo manuales de usuario y guías de configuración para desarrollos y servicios implementados.",
              "Capacitación a usuarios y equipos de soporte sobre el uso y administración de nuevas herramientas y sistemas."
            ]
          },
          {
            "name": "Estimación y Planificación de Proyectos",
            "tasks": [
              "Participación en la estimación y planificación de proyectos para construir nuevos portales, reconstruir servicios web y desarrollar módulos específicos (MQA Americas, Feduro)."
            ]
          }
        ]
      },
      {
        "position": "Practicante como Técnico en Contabilidad de Operaciones Comerciales y Financieras",
        "company": "(ASI) ASESORÍAS Y SISTEMAS INTEGRALES",
        "dates": "21/SEP/2018 - 21/OCT/2019"
      }
    ]
  }
}
