{
  "en": {
    "professionalTitle": "Full Stack Developer",
    "appTitles": {
      "skills": "Skills",
      "languagues": "Languagues",
      "hobbies": "Hobbies",
      "contact": "Contact",

      "profile": "Profile",
      "education": "Education",
      "employmentHistory": "Employment History"
    },
    "presentation": [
      "<code>< Hi there I'm Stiven Diaz /> </code>",
      "<span>-  I'm <span id='yearsOld'></span></span>",
      "<span>-  I'm a Full Stack Developer</span>"
    ],
    "description": "I am a Full Stack Developer with extensive experience in all stages of web development, from initial design and architecture to deployment and maintenance. I have a strong background in developing, testing, and debugging both frontend and backend applications, ensuring seamless integration and performance. <br /><br /> I bring a diverse and versatile skill set, proficient in technologies such as TypeScript, SASS, ReactJS, Angular, Node.js, C# (.Net) and Java (SpringBoot). I am adept at self-managing during independent projects and excel in collaborative team environments.",
    "professionalExperiences": [
      {
        "name": "End-to-End Web Development",
        "descriptions": [
          "Skilled in developing and maintaining complex web portals and internal applications, implementing new features, and optimizing existing functionalities for various clients, including CENOSA, Do it Center, ILP, CEMPRO, MQA Americas, and Feduro."
        ]
      },
      {
        "name": "Backend Services and API Development",
        "descriptions": [
          "Experience in creating and configuring RESTful APIs and web services for data exchange between systems, integrating third-party services, and ensuring secure and efficient data handling."
        ]
      },
      {
        "name": "Infrastructure and Server Management",
        "descriptions": [
          "Proficient in configuring servers (IIS, Linux, Windows Server) and deploying applications in development and production environments. Skilled in optimizing infrastructure to ensure reliable application performance."
        ]
      },
      {
        "name": "Process Automation and Workflow Optimization",
        "descriptions": [
          "Expertise in automating business processes, creating digital signature flows, and developing specialized modules for improving user experience and operational efficiency."
        ]
      },
      {
        "name": "Cross-Functional Collaboration",
        "descriptions": [
          "Strong communicator with experience in coordinating with multidisciplinary teams, participating in project planning, and conducting comprehensive testing to deliver high-quality solutions."
        ]
      },
      {
        "name": "Technical Documentation and Training",
        "descriptions": [
          "Capable of creating detailed technical documentation, user manuals, and guides. Experienced in training end-users and support teams on new tools and applications."
        ]
      },
      {
        "name": "Project Estimation and Planning",
        "descriptions": [
          "Involved in project estimation and planning for new web portals, rebuilding services, and developing new modules, contributing to strategic decision-making and resource allocation."
        ]
      }
    ],
    "keySkills": {
      "name": "key Skills",
      "skills": [
        "Advanced proficiency in TypeScript, SASS, ReactJS, Angular, Node.js, C# (.Net), Java (SpringBoot).",
        "Strong debugging and testing skills to ensure robust code and functionality.",
        "Ability to lead projects independently and work effectively in a team environment."
      ]
    }
  },
  "es": {
    "professionalTitle": "Desarrollador Full Stack",
    "appTitles": {
      "skills": "Aptitudes",
      "languagues": "Idiomas",
      "hobbies": "Hobbies",
      "contact": "Contacto",

      "profile": "Perfil",
      "education": "Educacion",
      "employmentHistory": "Historial Laboral"
    },
    "presentation": [
      "<code>< Hola soy Stiven Diaz /> </code>",
      "<span>-  Tengo <span id='yearsOld'></span></span>",
      "<span>-  Soy un Desarrollador Full Stack</span>"
    ],
    "description": "Soy un Desarrollador Full Stack con amplia experiencia en todas las etapas del desarrollo web, desde el dise帽o y la arquitectura inicial hasta el despliegue y mantenimiento. Tengo una s贸lida formaci贸n en el desarrollo, prueba y depuraci贸n de aplicaciones tanto de frontend como de backend, asegurando una integraci贸n y rendimiento sin problemas. <br /><br /> Poseo un conjunto de habilidades diverso y vers谩til, con dominio en tecnolog铆as como TypeScript, SASS, ReactJS, Angular, Node.js, C# (.Net) y Java (SpringBoot). Soy competente en la autogesti贸n durante proyectos independientes y sobresalgo en entornos de trabajo en equipo.",
    "professionalExperiences": [
      {
        "name": "Desarrollo Web de Extremo a Extremo",
        "descriptions": [
          "Habilidad en desarrollar y mantener portales web complejos y aplicaciones internas, implementando nuevas funciones y optimizando funcionalidades existentes para diversos clientes, incluidos CENOSA, Do it Center, ILP, CEMPRO, MQA Americas y Feduro."
        ]
      },
      {
        "name": "Desarrollo de Servicios Backend y API",
        "descriptions": [
          "Experiencia en la creaci贸n y configuraci贸n de APIs RESTful y servicios web para el intercambio de datos entre sistemas, integraci贸n de servicios de terceros, y asegurando un manejo de datos seguro y eficiente."
        ]
      },
      {
        "name": "Gesti贸n de Infraestructura y Servidores",
        "descriptions": [
          "Competencia en la configuraci贸n de servidores (IIS, Linux, Windows Server) y despliegue de aplicaciones en entornos de desarrollo y producci贸n. Habilidad en la optimizaci贸n de infraestructuras para asegurar un rendimiento confiable de las aplicaciones."
        ]
      },
      {
        "name": "Automatizaci贸n de Procesos y Optimizaci贸n de Flujos de Trabajo",
        "descriptions": [
          "Experto en automatizar procesos empresariales, crear flujos de firmas digitales y desarrollar m贸dulos especializados para mejorar la experiencia del usuario y la eficiencia operativa."
        ]
      },
      {
        "name": "Colaboraci贸n Multifuncional",
        "descriptions": [
          "Comunicador efectivo con experiencia en la coordinaci贸n con equipos multidisciplinarios, participando en la planificaci贸n de proyectos y realizando pruebas exhaustivas para entregar soluciones de alta calidad."
        ]
      },
      {
        "name": "Documentaci贸n T茅cnica y Capacitaci贸n",
        "descriptions": [
          "Capaz de crear documentaci贸n t茅cnica detallada, manuales de usuario y gu铆as. Experiencia en capacitar a los usuarios finales y equipos de soporte sobre nuevas herramientas y aplicaciones."
        ]
      },
      {
        "name": "Estimaci贸n y Planificaci贸n de Proyectos",
        "descriptions": [
          "Participaci贸n en la estimaci贸n y planificaci贸n de proyectos para nuevos portales web, reconstrucci贸n de servicios y desarrollo de nuevos m贸dulos, contribuyendo a la toma de decisiones estrat茅gicas y asignaci贸n de recursos."
        ]
      }
    ],
    "keySkills": {
      "name": "Aptitudes Claves",
      "skills": [
        "Dominio avanzado de TypeScript, SASS, ReactJS, Angular, Node.js, C# (.Net), Java (SpringBoot).",
        "Fuertes habilidades de depuraci贸n y pruebas para garantizar c贸digo robusto y funcional.",
        "Capacidad para liderar proyectos de forma independiente y trabajar eficazmente en un entorno de equipo."
      ]
    }
  }
}
